In [1]:
import pandas as pd

In [2]:
df1= pd.DataFrame([[1,2,3],[2,7,3],[6,3,9]],columns= ['A','B','C'])

In [3]:
df2= pd.DataFrame([[11,7,312],[22,3,35],[63,2,92]],columns= ['X','Y','Z'])

In [4]:
df1

   A  B  C
0  1  2  3
1  2  7  3
2  6  3  9

In [5]:
df2

    X  Y    Z
0  11  7  312
1  22  3   35
2  63  2   92

In [6]:
df3= pd.merge(df2,df1,left_on= 'Y',right_on='B') 
# SORTS AND MERGES THE TWO DATAFRAMES BASED ON THE VALUES OF LEFT DATAFRAMES
# MAKE SURE THE DATAFRAME(df2,df1) ON LEFT IS MENTIONED as per the required sequence AND 
# CORRESPOnDING VALUES OF COLUMNS IN THE SAME ORDER of dataframes mentioned (df2->Y, DF1->A)

In [7]:
df3

    X  Y    Z  A  B  C
0  11  7  312  2  7  3
1  22  3   35  6  3  9
2  63  2   92  1  2  3

In [8]:
df3.to_csv('export1.csv',index= False) # used to remove the first default index column.

In [9]:
df1

   A  B  C
0  1  2  3
1  2  7  3
2  6  3  9

In [10]:
df1.index= ['zero','one','two']

In [11]:
df1

      A  B  C
zero  1  2  3
one   2  7  3
two   6  3  9